# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

n1 = 5
n2 = 6

bit_and = n1 & n2
bit_or = n1 | n2
right_shift = n1 >> 2
left_shift = n1 << 2

print(f'Побитовая операция "И" над числами  {n1} и {n2} = {bit_and} ({bin(bit_and)})')
print(f'Побитовая операция "ИЛИ" над числами  {n1} и {n2} = {bit_or} ({bin(bit_or)})')
print(f'Побитовый сдвиг вправо числа {n1} на 2 знака = {right_shift} ({bin(right_shift)})')
print(f'Побитовый сдвиг влево числа {n1} на 2 знака = {left_shift} ({bin(left_shift)})')
